---
kind: enumMember
id: F:Autodesk.Revit.UI.Macros.UIDocumentMacroOptions.EnableMacros
enum: Autodesk.Revit.UI.Macros.UIDocumentMacroOptions
source: html/58b01732-d76b-ea31-8dd6-a2da7c90106d.htm
---
# Autodesk.Revit.UI.Macros.UIDocumentMacroOptions.EnableMacros

The option to enable macros in the document.